

LABEL_NAMES = {'M': 'Морось', 'SR': 'Слабый дождь', 'MR': 'Умеренный дождь', 'HR': 'Ливневый дождь',
               'BD': '"Большие капли"', 'DS': 'Сухой снег', 'WS': 'Мокрый снег', 'IC': 'Ориентированные кристаллы льда'}


XLIMS = {'Zh': [0, 60], 'Zdr': [-1, 6]}

MF_Zh = {'M': [-10, -9, 20, 30], 'SR': [0, 5, 10, 20]}

MF_Zdr = {'M': [-0.3, 0, 1, 1.3], 'SR': [-0.1, 0.3, 0.9, 1.1], 'MR': [0.6, 1, 2, 2.5], 'HR': [2.2, 2.4, 4, 4.5],
          'BD': [1.1, 2, 4, 5.1], 'DS': [-1, 0, 0.4, 0.8], 'WS': [-0.5, 0, 2.5, 3.5], 'IC': [-4.5, -3.5, 2.5, 5.5]}
